apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_flexio.h
#define FLEXIO_VERID_MAJOR_MASK                  (0xff000000u)
#define FLEXIO_VERID_MAJOR_SHIFT                 (24u)

/* MAJOR - Major Version Number */
#define FLEXIO_VERID_MAJOR(x)                    ((((uint32_t)(x)) << FLEXIO_VERID_MAJOR_SHIFT) & FLEXIO_VERID_MAJOR_MASK)

/* PARAM - Parameter Register */

#define FLEXIO_PARAM_SHIFTER_MASK                (0xffu)
#define FLEXIO_PARAM_SHIFTER_SHIFT               (0u)

/* SHIFTER - Shifter Number */
#define FLEXIO_PARAM_SHIFTER(x)                  ((((uint32_t)(x)) << FLEXIO_PARAM_SHIFTER_SHIFT) & FLEXIO_PARAM_SHIFTER_MASK)

#define FLEXIO_PARAM_TIMER_MASK                  (0xff00u)
#define FLEXIO_PARAM_TIMER_SHIFT                 (8u)

/* TIMER - Timer Number */

#define FLEXIO_PARAM_TIMER(x)                    ((((uint32_t)(x)) << FLEXIO_PARAM_TIMER_SHIFT) & FLEXIO_PARAM_TIMER_MASK)

#define FLEXIO_PARAM_PIN_MASK                    (0xff0000u)
#define FLEXIO_PARAM_PIN_SHIFT                   (16u)

/* PIN - Pin Number */
#define FLEXIO_PARAM_PIN(x)                      ((((uint32_t)(x)) << FLEXIO_PARAM_PIN_SHIFT) & FLEXIO_PARAM_PIN_MASK)

#define FLEXIO_PARAM_TRIGGER_MASK                (0xff000000u)
#define FLEXIO_PARAM_TRIGGER_SHIFT               (24u)

/* TRIGGER - Trigger Number */

#define FLEXIO_PARAM_TRIGGER(x)                  ((((uint32_t)(x)) << FLEXIO_PARAM_TRIGGER_SHIFT) & FLEXIO_PARAM_TRIGGER_MASK)

/* CTRL - FlexIO Control Register */

#define FLEXIO_CTRL_FLEXEN_MASK                  (0x1u)
#define FLEXIO_CTRL_FLEXEN_SHIFT                 (0u)

/* FLEXEN - FlexIO Enable
 *  0b0..FlexIO module is disabled.
 *  0b1..FlexIO module is enabled.
 */

#define FLEXIO_CTRL_FLEXEN(x)                    ((((uint32_t)(x)) << FLEXIO_CTRL_FLEXEN_SHIFT) & FLEXIO_CTRL_FLEXEN_MASK)

#define FLEXIO_CTRL_SWRST_MASK                   (0x2u)
#define FLEXIO_CTRL_SWRST_SHIFT                  (1u)

/* SWRST - Software Reset
 *  0b0..Software reset is disabled
 *  0b1..Software reset is enabled, all FlexIO registers except the Control
 *       Register are reset.
 */

#define FLEXIO_CTRL_SWRST(x)                     ((((uint32_t)(x)) << FLEXIO_CTRL_SWRST_SHIFT) & FLEXIO_CTRL_SWRST_MASK)

#define FLEXIO_CTRL_FASTACC_MASK                 (0x4u)
#define FLEXIO_CTRL_FASTACC_SHIFT                (2u)

/* FASTACC - Fast Access
 *  0b0..Configures for normal register accesses to FlexIO
 *  0b1..Configures for fast register accesses to FlexIO
 */

#define FLEXIO_CTRL_FASTACC(x)                   ((((uint32_t)(x)) << FLEXIO_CTRL_FASTACC_SHIFT) & FLEXIO_CTRL_FASTACC_MASK)

#define FLEXIO_CTRL_DBGE_MASK                    (0x40000000u)
#define FLEXIO_CTRL_DBGE_SHIFT                   (30u)

/* DBGE - Debug Enable
 *  0b0..FlexIO is disabled in debug modes.
 *  0b1..FlexIO is enabled in debug modes
 */

#define FLEXIO_CTRL_DBGE(x)                      ((((uint32_t)(x)) << FLEXIO_CTRL_DBGE_SHIFT) & FLEXIO_CTRL_DBGE_MASK)

#define FLEXIO_CTRL_DOZEN_MASK                   (0x80000000u)
#define FLEXIO_CTRL_DOZEN_SHIFT                  (31u)

/* DOZEN - Doze Enable
 *  0b0..FlexIO enabled in Doze modes.
 *  0b1..FlexIO disabled in Doze modes.
 */

#define FLEXIO_CTRL_DOZEN(x)                     ((((uint32_t)(x)) << FLEXIO_CTRL_DOZEN_SHIFT) & FLEXIO_CTRL_DOZEN_MASK)

/* PIN - Pin State Register */

#define FLEXIO_PIN_PDI_MASK                      (0xffffffffu)  /* Merged from fields with different position or width, of widths (16, 32), largest definition used */
#define FLEXIO_PIN_PDI_SHIFT                     (0u)

/* PDI - Pin Data Input */

#define FLEXIO_PIN_PDI(x)                        ((((uint32_t)(x)) << FLEXIO_PIN_PDI_SHIFT) & FLEXIO_PIN_PDI_MASK)  /* Merged from fields with different position or width, of widths (16, 32), largest definition used */

/* SHIFTSTAT - Shifter Status Register */

#define FLEXIO_SHIFTSTAT_SSF_MASK                (0xffu)
#define FLEXIO_SHIFTSTAT_SSF_SHIFT               (0u)

/* SSF - Shifter Status Flag */

#define FLEXIO_SHIFTSTAT_SSF(x)                  ((((uint32_t)(x)) << FLEXIO_SHIFTSTAT_SSF_SHIFT) & FLEXIO_SHIFTSTAT_SSF_MASK)

/* SHIFTERR - Shifter Error Register */

#define FLEXIO_SHIFTERR_SEF_MASK                 (0xffu)
#define FLEXIO_SHIFTERR_SEF_SHIFT                (0u)

/* SEF - Shifter Error Flags */

#define FLEXIO_SHIFTERR_SEF(x)                   ((((uint32_t)(x)) << FLEXIO_SHIFTERR_SEF_SHIFT) & FLEXIO_SHIFTERR_SEF_MASK)

/* TIMSTAT - Timer Status Register */

#define FLEXIO_TIMSTAT_TSF_MASK                  (0xffu)
#define FLEXIO_TIMSTAT_TSF_SHIFT                 (0u)

/* TSF - Timer Status Flags */

#define FLEXIO_TIMSTAT_TSF(x)                    ((((uint32_t)(x)) << FLEXIO_TIMSTAT_TSF_SHIFT) & FLEXIO_TIMSTAT_TSF_MASK)

/* SHIFTSIEN - Shifter Status Interrupt Enable */

#define FLEXIO_SHIFTSIEN_SSIE_MASK               (0xffu)
#define FLEXIO_SHIFTSIEN_SSIE_SHIFT              (0u)

/* SSIE - Shifter Status Interrupt Enable */

#define FLEXIO_SHIFTSIEN_SSIE(x)                 ((((uint32_t)(x)) << FLEXIO_SHIFTSIEN_SSIE_SHIFT) & FLEXIO_SHIFTSIEN_SSIE_MASK)

/* SHIFTEIEN - Shifter Error Interrupt Enable */

#define FLEXIO_SHIFTEIEN_SEIE_MASK               (0xffu)
#define FLEXIO_SHIFTEIEN_SEIE_SHIFT              (0u)

/* SEIE - Shifter Error Interrupt Enable */

#define FLEXIO_SHIFTEIEN_SEIE(x)                 ((((uint32_t)(x)) << FLEXIO_SHIFTEIEN_SEIE_SHIFT) & FLEXIO_SHIFTEIEN_SEIE_MASK)

/* TIMIEN - Timer Interrupt Enable Register */

#define FLEXIO_TIMIEN_TEIE_MASK                  (0xffu)
#define FLEXIO_TIMIEN_TEIE_SHIFT                 (0u)

/* TEIE - Timer Status Interrupt Enable */

#define FLEXIO_TIMIEN_TEIE(x)                    ((((uint32_t)(x)) << FLEXIO_TIMIEN_TEIE_SHIFT) & FLEXIO_TIMIEN_TEIE_MASK)

/* SHIFTSDEN - Shifter Status DMA Enable */

#define FLEXIO_SHIFTSDEN_SSDE_MASK               (0xffu)
#define FLEXIO_SHIFTSDEN_SSDE_SHIFT              (0u)

/* SSDE - Shifter Status DMA Enable */

#define FLEXIO_SHIFTSDEN_SSDE(x)                 ((((uint32_t)(x)) << FLEXIO_SHIFTSDEN_SSDE_SHIFT) & FLEXIO_SHIFTSDEN_SSDE_MASK)

/* SHIFTSTATE - Shifter State Register */

