apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_flexio.h
#define FLEXIO_SHIFTSTATE_STATE_MASK             (0x7u)
#define FLEXIO_SHIFTSTATE_STATE_SHIFT            (0u)

/* STATE - Current State Pointer */

#define FLEXIO_SHIFTSTATE_STATE(x)               ((((uint32_t)(x)) << FLEXIO_SHIFTSTATE_STATE_SHIFT) & FLEXIO_SHIFTSTATE_STATE_MASK)

/* SHIFTCTL - Shifter Control N Register */

#define FLEXIO_SHIFTCTL_SMOD_MASK                (0x7u)
#define FLEXIO_SHIFTCTL_SMOD_SHIFT               (0u)

/* SMOD - Shifter Mode
 *  0b000..Disabled.
 *  0b001..Receive mode. Captures the current Shifter content into the
 *         SHIFTBUF on expiration of the Timer.
 *  0b010..Transmit mode. Load SHIFTBUF contents into the Shifter on
 *         expiration of the Timer.
 *  0b011..Reserved.
 *  0b100..Match Store mode. Shifter data is compared to SHIFTBUF content on
 *         expiration of the Timer.
 *  0b101..Match Continuous mode. Shifter data is continuously compared to
 *         SHIFTBUF contents.
 *  0b110..State mode. SHIFTBUF contents are used for storing programmable
 *         state attributes.
 *  0b111..Logic mode. SHIFTBUF contents are used for implementing
 *         programmable logic look up table.
 */

#define FLEXIO_SHIFTCTL_SMOD(x)                  ((((uint32_t)(x)) << FLEXIO_SHIFTCTL_SMOD_SHIFT) & FLEXIO_SHIFTCTL_SMOD_MASK)

#define FLEXIO_SHIFTCTL_PINPOL_MASK              (0x80u)
#define FLEXIO_SHIFTCTL_PINPOL_SHIFT             (7u)

/* PINPOL - Shifter Pin Polarity
 *  0b0..Pin is active high
 *  0b1..Pin is active low
 */

#define FLEXIO_SHIFTCTL_PINPOL(x)                ((((uint32_t)(x)) << FLEXIO_SHIFTCTL_PINPOL_SHIFT) & FLEXIO_SHIFTCTL_PINPOL_MASK)

#define FLEXIO_SHIFTCTL_PINSEL_MASK              (0x1f00u)  /* Merged from fields with different position or width, of widths (4, 5), largest definition used */
#define FLEXIO_SHIFTCTL_PINSEL_SHIFT             (8u)

/* PINSEL - Shifter Pin Select */

#define FLEXIO_SHIFTCTL_PINSEL(x)                ((((uint32_t)(x)) << FLEXIO_SHIFTCTL_PINSEL_SHIFT) & FLEXIO_SHIFTCTL_PINSEL_MASK)  /* Merged from fields with different position or width, of widths (4, 5), largest definition used */

#define FLEXIO_SHIFTCTL_PINCFG_MASK              (0x30000u)
#define FLEXIO_SHIFTCTL_PINCFG_SHIFT             (16u)

/* PINCFG - Shifter Pin Configuration
 *  0b00..Shifter pin output disabled
 *  0b01..Shifter pin open drain or bidirectional output enable
 *  0b10..Shifter pin bidirectional output data
 *  0b11..Shifter pin output
 */

#define FLEXIO_SHIFTCTL_PINCFG(x)                ((((uint32_t)(x)) << FLEXIO_SHIFTCTL_PINCFG_SHIFT) & FLEXIO_SHIFTCTL_PINCFG_MASK)

#define FLEXIO_SHIFTCTL_TIMPOL_MASK              (0x800000u)
#define FLEXIO_SHIFTCTL_TIMPOL_SHIFT             (23u)

/* TIMPOL - Timer Polarity
 *  0b0..Shift on posedge of Shift clock
 *  0b1..Shift on negedge of Shift clock
 */

#define FLEXIO_SHIFTCTL_TIMPOL(x)                ((((uint32_t)(x)) << FLEXIO_SHIFTCTL_TIMPOL_SHIFT) & FLEXIO_SHIFTCTL_TIMPOL_MASK)

#define FLEXIO_SHIFTCTL_TIMSEL_MASK              (0x7000000u)
#define FLEXIO_SHIFTCTL_TIMSEL_SHIFT             (24u)

/* TIMSEL - Timer Select */

#define FLEXIO_SHIFTCTL_TIMSEL(x)                ((((uint32_t)(x)) << FLEXIO_SHIFTCTL_TIMSEL_SHIFT) & FLEXIO_SHIFTCTL_TIMSEL_MASK)

/* The count of FLEXIO_SHIFTCTL */

#define FLEXIO_SHIFTCTL_COUNT                    (8u)

/* SHIFTCFG - Shifter Configuration N Register */

#define FLEXIO_SHIFTCFG_SSTART_MASK              (0x3u)
#define FLEXIO_SHIFTCFG_SSTART_SHIFT             (0u)

/* SSTART - Shifter Start bit
 *  0b00..Start bit disabled for transmitter/receiver/match store,
 *        transmitter loads data on enable
 *  0b01..Start bit disabled for transmitter/receiver/match store,
 *        transmitter loads data on first shift
 *  0b10..Transmitter outputs start bit value 0 before loading data on first
 *        shift, receiver/match store sets error flag if start bit is not 0
 *  0b11..Transmitter outputs start bit value 1 before loading data on first
 *        shift, receiver/match store sets error flag if start bit is not 1
 */

#define FLEXIO_SHIFTCFG_SSTART(x)                ((((uint32_t)(x)) << FLEXIO_SHIFTCFG_SSTART_SHIFT) & FLEXIO_SHIFTCFG_SSTART_MASK)

#define FLEXIO_SHIFTCFG_SSTOP_MASK               (0x30u)
#define FLEXIO_SHIFTCFG_SSTOP_SHIFT              (4u)

/* SSTOP - Shifter Stop bit
 *  0b00..Stop bit disabled for transmitter/receiver/match store
 *  0b01..Reserved for transmitter/receiver/match store
 *  0b10..Transmitter outputs stop bit value 0 on store, receiver/match store
 *        sets error flag if stop bit is not 0
 *  0b11..Transmitter outputs stop bit value 1 on store, receiver/match store
 *        sets error flag if stop bit is not 1
 */

#define FLEXIO_SHIFTCFG_SSTOP(x)                 ((((uint32_t)(x)) << FLEXIO_SHIFTCFG_SSTOP_SHIFT) & FLEXIO_SHIFTCFG_SSTOP_MASK)

#define FLEXIO_SHIFTCFG_INSRC_MASK               (0x100u)
#define FLEXIO_SHIFTCFG_INSRC_SHIFT              (8u)

/* INSRC - Input Source
 *  0b0..Pin
 *  0b1..Shifter N+1 Output
 */

#define FLEXIO_SHIFTCFG_INSRC(x)                 ((((uint32_t)(x)) << FLEXIO_SHIFTCFG_INSRC_SHIFT) & FLEXIO_SHIFTCFG_INSRC_MASK)

#define FLEXIO_SHIFTCFG_PWIDTH_MASK              (0x1f0000u)  /* Merged from fields with different position or width, of widths (4, 5), largest definition used */
#define FLEXIO_SHIFTCFG_PWIDTH_SHIFT             (16u)

/* PWIDTH - Parallel Width */

#define FLEXIO_SHIFTCFG_PWIDTH(x)                ((((uint32_t)(x)) << FLEXIO_SHIFTCFG_PWIDTH_SHIFT) & FLEXIO_SHIFTCFG_PWIDTH_MASK)  /* Merged from fields with different position or width, of widths (4, 5), largest definition used */

/* The count of FLEXIO_SHIFTCFG */

#define FLEXIO_SHIFTCFG_COUNT                    (8u)

/* SHIFTBUF - Shifter Buffer N Register */

#define FLEXIO_SHIFTBUF_SHIFTBUF_MASK            (0xffffffffu)
#define FLEXIO_SHIFTBUF_SHIFTBUF_SHIFT           (0u)

/* SHIFTBUF - Shift Buffer */

#define FLEXIO_SHIFTBUF_SHIFTBUF(x)              ((((uint32_t)(x)) << FLEXIO_SHIFTBUF_SHIFTBUF_SHIFT) & FLEXIO_SHIFTBUF_SHIFTBUF_MASK)

