apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_flexio.h
#define FLEXIO_TIMCFG_TIMDEC_MASK                (0x300000u)
#define FLEXIO_TIMCFG_TIMDEC_SHIFT               (20U)

/* TIMDEC - Timer Decrement
 *  0b00..Decrement counter on FlexIO clock, Shift clock equals Timer output.
 *  0b01..Decrement counter on Trigger input (both edges), Shift clock equals
 *        Timer output.
 *  0b10..Decrement counter on Pin input (both edges), Shift clock equals Pin
 *        input.
 *  0b11..Decrement counter on Trigger input (both edges), Shift clock equals
 *        Trigger input.
 */

#define FLEXIO_TIMCFG_TIMDEC(x)                  ((((uint32_t)(x)) << FLEXIO_TIMCFG_TIMDEC_SHIFT) & FLEXIO_TIMCFG_TIMDEC_MASK)

#define FLEXIO_TIMCFG_TIMOUT_MASK                (0x3000000u)
#define FLEXIO_TIMCFG_TIMOUT_SHIFT               (24u)

/* TIMOUT - Timer Output
 *  0b00..Timer output is logic one when enabled and is not affected by timer
 *        reset
 *  0b01..Timer output is logic zero when enabled and is not affected by
 *        timer reset
 *  0b10..Timer output is logic one when enabled and on timer reset
 *  0b11..Timer output is logic zero when enabled and on timer reset
 */

#define FLEXIO_TIMCFG_TIMOUT(x)                  ((((uint32_t)(x)) << FLEXIO_TIMCFG_TIMOUT_SHIFT) & FLEXIO_TIMCFG_TIMOUT_MASK)

/* The count of FLEXIO_TIMCFG */

#define FLEXIO_TIMCFG_COUNT                      (8u)

/* TIMCMP - Timer Compare N Register */

#define FLEXIO_TIMCMP_CMP_MASK                   (0xffffu)
#define FLEXIO_TIMCMP_CMP_SHIFT                  (0u)

/* CMP - Timer Compare Value */

#define FLEXIO_TIMCMP_CMP(x)                     ((((uint32_t)(x)) << FLEXIO_TIMCMP_CMP_SHIFT) & FLEXIO_TIMCMP_CMP_MASK)

/* The count of FLEXIO_TIMCMP */

#define FLEXIO_TIMCMP_COUNT                      (8u)

/* SHIFTBUFNBS - Shifter Buffer N Nibble Byte Swapped Register */

#define FLEXIO_SHIFTBUFNBS_SHIFTBUFNBS_MASK      (0xffffffffu)
#define FLEXIO_SHIFTBUFNBS_SHIFTBUFNBS_SHIFT     (0u)

/* SHIFTBUFNBS - Shift Buffer */

#define FLEXIO_SHIFTBUFNBS_SHIFTBUFNBS(x)        ((((uint32_t)(x)) << FLEXIO_SHIFTBUFNBS_SHIFTBUFNBS_SHIFT) & FLEXIO_SHIFTBUFNBS_SHIFTBUFNBS_MASK)

/* The count of FLEXIO_SHIFTBUFNBS */

#define FLEXIO_SHIFTBUFNBS_COUNT                 (8u)

/* SHIFTBUFHWS - Shifter Buffer N Half Word Swapped Register */

#define FLEXIO_SHIFTBUFHWS_SHIFTBUFHWS_MASK      (0xffffffffu)
#define FLEXIO_SHIFTBUFHWS_SHIFTBUFHWS_SHIFT     (0u)

/* SHIFTBUFHWS - Shift Buffer */

#define FLEXIO_SHIFTBUFHWS_SHIFTBUFHWS(x)        ((((uint32_t)(x)) << FLEXIO_SHIFTBUFHWS_SHIFTBUFHWS_SHIFT) & FLEXIO_SHIFTBUFHWS_SHIFTBUFHWS_MASK)

/* The count of FLEXIO_SHIFTBUFHWS */

#define FLEXIO_SHIFTBUFHWS_COUNT                 (8u)

/* SHIFTBUFNIS - Shifter Buffer N Nibble Swapped Register */

#define FLEXIO_SHIFTBUFNIS_SHIFTBUFNIS_MASK      (0xffffffffu)
#define FLEXIO_SHIFTBUFNIS_SHIFTBUFNIS_SHIFT     (0u)

/* SHIFTBUFNIS - Shift Buffer */

#define FLEXIO_SHIFTBUFNIS_SHIFTBUFNIS(x)        ((((uint32_t)(x)) << FLEXIO_SHIFTBUFNIS_SHIFTBUFNIS_SHIFT) & FLEXIO_SHIFTBUFNIS_SHIFTBUFNIS_MASK)

/* The count of FLEXIO_SHIFTBUFNIS */

#define FLEXIO_SHIFTBUFNIS_COUNT                 (8u)

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_FLEXIO_H */
